# Programming and Data Analysis

> Dataframe Wrangling with Pandas

Kuo, Yao-Jen <yaojenkuo@ntu.edu.tw> from [DATAINPOINT](https://www.datainpoint.com/)

In [1]:
from datetime import date
from datetime import timedelta
import urllib.error
import pandas as pd

## About `pandas`

## What is `pandas`?

> Flexible and powerful data analysis / manipulation library for Python, providing labeled data structures similar to R data.frame objects, statistical functions, and much more.

Source: <https://github.com/pandas-dev/pandas>

## Why `pandas`?

Python used to have a weak spot in its analysis capability due to it did not have an appropriate structure handling the common tabular datasets. Pythonists had to switch to a more data-centric language like R or Matlab during the analysis stage until the presence of `pandas`.

## Import Pandas with `import` command

Pandas is officially aliased as `pd`.

In [2]:
import pandas as pd

## If Pandas is not installed, we will encounter a `ModuleNotFoundError`

```
Traceback (most recent call last):
  File "<stdin>", line 1, in <module>
ModuleNotFoundError: No module named 'pandas'
```

## Use `pip install` at Terminal to install pandas

```bash
pip install pandas
```

## Check version and its installation file path

- `__version__` attribute
- `__file__` attribute

In [3]:
print(pd.__version__)
print(pd.__file__)

1.2.4
/Users/kuoyaojen/opt/miniconda3/envs/pyds/lib/python3.8/site-packages/pandas/__init__.py

## What does `pandas` mean?

![](https://media.giphy.com/media/46Zj6ze2Z2t4k/giphy.gif)

Source: <https://giphy.com/>

## Turns out its naming has nothing to do with panda the animal, it refers to three primary class customed by its author [Wes McKinney](https://wesmckinney.com/)

- **Pan**el(Deprecated since version 0.20.0)
- **Da**taFrame
- **S**eries

## In order to master `pandas`, it is vital to understand the relationships between `Index`, `ndarray`, `Series`, and `DataFrame`

- An `Index` and a `ndarray` assembles a `Series`.
- A couple of `Series` that sharing the same `Index` can then form a `DataFrame`.

## `Index` from Pandas

The simpliest way to create an `Index` is using `pd.Index()`.

In [4]:
prime_indices = pd.Index([2, 3, 5, 7, 11, 13, 17, 19, 23, 29])
print(type(prime_indices))

<class 'pandas.core.indexes.numeric.Int64Index'>

## An `Index` is like a combination of `tuple` and `set`

In [5]:
# immutable
prime_indices = pd.Index([2, 3, 5, 7, 11, 13, 17, 19, 23, 29])
try:
    prime_indices[-1] = 31
except TypeError as e:
    print(e)

Index does not support mutable operations

In [6]:
# Index has the characteristics of a set
odd_indices = pd.Index(range(1, 30, 2))
print(prime_indices.intersection(odd_indices))         # prime_indices & odd_indices
print(prime_indices.union(odd_indices))                # prime_indices | odd_indices
print(prime_indices.symmetric_difference(odd_indices)) # prime_indices ^ odd_indices
print(prime_indices.difference(odd_indices))
print(odd_indices.difference(prime_indices))

Int64Index([3, 5, 7, 11, 13, 17, 19, 23, 29], dtype='int64')
Int64Index([1, 2, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29], dtype='int64')
Int64Index([1, 2, 9, 15, 21, 25, 27], dtype='int64')
Int64Index([2], dtype='int64')
Int64Index([1, 9, 15, 21, 25, 27], dtype='int64')

## `Series` from Pandas

The simplest way to create a `Series` is using `pd.Series()`.

In [7]:
prime_series = pd.Series([2, 3, 5, 7, 11, 13, 17, 19, 23, 29])
print(type(prime_series))
print(prime_series)

<class 'pandas.core.series.Series'>
0     2
1     3
2     5
3     7
4    11
5    13
6    17
7    19
8    23
9    29
dtype: int64

## A `Series` is a combination of `Index` and `ndarray`

In [8]:
print(type(prime_series.index))
print(type(prime_series.values))

<class 'pandas.core.indexes.range.RangeIndex'>
<class 'numpy.ndarray'>

## The index of a `Series` can be customized

In [9]:
prime_series = pd.Series([2, 3, 5, 7, 11, 13, 17, 19, 23, 29],
                        index=range(1, 11))
prime_series

1      2
2      3
3      5
4      7
5     11
6     13
7     17
8     19
9     23
10    29
dtype: int64

In [10]:
prime_series = pd.Series([2, 3, 5, 7, 11, 13, 17, 19, 23, 29])
prime_series.index = range(1, 11)
prime_series

1      2
2      3
3      5
4      7
5     11
6     13
7     17
8     19
9     23
10    29
dtype: int64

## `DataFrame` from Pandas

The simplest way to create a `DataFrame` is using `pd.DataFrame()`.

In [11]:
# column-wise
movie_df = pd.DataFrame()
movie_df["title"] = ["The Shawshank Redemption", "The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"]
movie_df["imdb_rating"] = [9.3, 9.0, 8.9, 8.8, 8.7]
type(movie_df)

pandas.core.frame.DataFrame

In [12]:
movie_df

                      title  imdb_rating
0  The Shawshank Redemption          9.3
1           The Dark Knight          9.0
2          Schindler's List          8.9
3              Forrest Gump          8.8
4                 Inception          8.7

## `DataFrame` from Pandas

Creating a `DataFrame` with a `dict`.

In [13]:
# column-wise
movie_dict = {
    "title": ["The Shawshank Redemption", "The Dark Knight", "Schindler's List", "Forrest Gump", "Inception"],
    "imdb_rating": [9.3, 9.0, 8.9, 8.8, 8.7]
}
movie_df = pd.DataFrame(movie_dict)
type(movie_df)

pandas.core.frame.DataFrame

In [14]:
movie_df

                      title  imdb_rating
0  The Shawshank Redemption          9.3
1           The Dark Knight          9.0
2          Schindler's List          8.9
3              Forrest Gump          8.8
4                 Inception          8.7

## `DataFrame` from Pandas

Creating a `DataFrame` with a `list` of dictionaries.

In [15]:
# row-wise
movie_list = [
    {"title": "The Shawshank Redemption", "imdb_rating": 9.3},
    {"title": "The Dark Knight", "imdb_rating": 9.0},
    {"title": "Schindler's List", "imdb_rating": 8.9},
    {"title": "Forrest Gump", "imdb_rating": 8.8},
    {"title": "Inception", "imdb_rating": 8.7}
]
movie_df = pd.DataFrame(movie_list)
type(movie_df)

pandas.core.frame.DataFrame

In [16]:
movie_df

                      title  imdb_rating
0  The Shawshank Redemption          9.3
1           The Dark Knight          9.0
2          Schindler's List          8.9
3              Forrest Gump          8.8
4                 Inception          8.7

## A `DataFrame` is a combination of multiple `Series` sharing the same `Index`

In [17]:
print(type(movie_df.index))
print(type(movie_df["title"]))
print(type(movie_df["imdb_rating"]))

<class 'pandas.core.indexes.range.RangeIndex'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

## Review of the definition of modern data science

> Modern data science is a huge field, it invovles applications and tools like importing, tidying, transformation, visualization, modeling, and communication. Surrounding all these is programming.

![Imgur](https://i.imgur.com/din6Ig6.png)

Source: [R for Data Science](https://r4ds.had.co.nz/)

## Key functionalities analysts rely on `pandas` are

- Importing
- Tidying
- Transforming

## Tidying and transforming together is also known as WRANGLING

![](https://media.giphy.com/media/MnlZWRFHR4xruE4N2Z/giphy.gif)

Source: <https://giphy.com/>

## Importing

## `pandas` has massive functions importing tabular data

- Flat text file
- Database table
- Spreadsheet
- JSON
- HTML `<table></table>` tags
- ...etc.

Source: <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>

## Using `read_csv` function for flat text files

In [18]:
def get_latest_daily_report():
    data_date = date.today()
    day_delta = timedelta(days=1)
    while True:
        data_date_str = date.strftime(data_date, '%m-%d-%Y')
        print("Try importing {} data...".format(data_date_str))
        daily_report_url = "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports/{}.csv".format(data_date_str)
        try:
            daily_report = pd.read_csv(daily_report_url)
            print("Successfully imported {} data!".format(data_date_str))
            break
        except urllib.error.HTTPError:
            data_date -= day_delta
    return daily_report

In [19]:
daily_report = get_latest_daily_report()

Try importing 11-24-2021 data...
Try importing 11-23-2021 data...
Successfully imported 11-23-2021 data!

## The `data` folder of our environment

[classroom-programming-and-data-analysis/data](https://mybinder.org/v2/gh/datainpoint/classroom-programming-and-data-analysis/HEAD?labpath=data)

## Using `read_sql` function for database tables

```python
import sqlite3

conn = sqlite3.connect('YOUR_DATABASE.db')
sql_query = """
SELECT * 
  FROM YOUR_TABLE
 LIMIT 10;
"""
pd.read_sql(sql_query, conn)
```

## Using `read_excel` function for spreadsheets

```python
excel_file_path = "PATH/TO/YOUR/EXCEL/FILE"
pd.read_excel(excel_file_path)
```

## Using `read_json` function for JSON

```python
json_file_path = "PATH/TO/YOUR/JSON/FILE"
pd.read_json(json_file_path)
```

## What is JSON?

> JSON (JavaScript Object Notation) is a lightweight data-interchange format. JSON is built on two structures:
>
> A collection of name/value pairs. In various languages, this is realized as an object, record, struct, dictionary, hash table, keyed list, or associative array. An ordered list of values. In most languages, this is realized as an array, vector, list, or sequence.

Source: <https://www.json.org/json-en.html>

## Two flavors of tabular data

- Row-based JSON.
- Column-based JSON.

## Using `read_html` function for HTML `<table></table>` tags

> The `<table>` tag defines an HTML table. An HTML table consists of one `<table>` element and one or more `<tr>`, `<th>`, and `<td>` elements. The `<tr>` element defines a table row, the `<th>` element defines a table header, and the `<td>` element defines a table cell.

Source: <https://www.w3schools.com/default.asp>

In [20]:
request_url = "https://www.imdb.com/chart/top"
html_tables = pd.read_html(request_url)
print(type(html_tables))
print(len(html_tables))

<class 'list'>
1

In [21]:
html_tables[0]

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. 刺激1995 (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. 教父 (1972),9.1,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. 教父第二集 (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. 黑暗騎士 (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. 十二怒漢 (1957),8.9,12345678910 NOT YET RELEASED Seen,NaN
...,...,...,...,...,...
245,NaN,246. 阿爾及爾之戰 (1966),8.0,12345678910 NOT YET RELEASED Seen,NaN
246,NaN,247. 卡比莉亞之夜 (1957),8.0,12345678910 NOT YET RELEASED Seen,NaN
247,NaN,248. 公主新娘 (1987),8.0,12345678910 NOT YET RELEASED Seen,NaN
248,NaN,249. 巴黎，德州 (1984),8.0,12345678910 NOT YET RELEASED Seen,NaN
249,NaN,250. Soorarai Pottru (2020),8.0,12345678910 NOT YET RELEASED Seen,NaN

## Basic attributes and methods

## Basic attributes of a `DataFrame` object

- `shape`
- `dtypes`
- `index`
- `columns`

In [22]:
print(daily_report.shape)
print(daily_report.dtypes)
print(daily_report.index)
print(daily_report.columns)

(4006, 14)
FIPS                   float64
Admin2                  object
Province_State          object
Country_Region          object
Last_Update             object
Lat                    float64
Long_                  float64
Confirmed                int64
Deaths                   int64
Recovered              float64
Active                 float64
Combined_Key            object
Incident_Rate          float64
Case_Fatality_Ratio    float64
dtype: object
RangeIndex(start=0, stop=4006, step=1)
Index(['FIPS', 'Admin2', 'Province_State', 'Country_Region', 'Last_Update',
       'Lat', 'Long_', 'Confirmed', 'Deaths', 'Recovered', 'Active',
       'Combined_Key', 'Incident_Rate', 'Case_Fatality_Ratio'],
      dtype='object')

## Basic methods of a `DataFrame` object

- `head(n)`
- `tail(n)`
- `describe()`
- `info()`
- `set_index()`
- `reset_index()`

## `head(n)` returns the top n observations with header

In [23]:
daily_report.head() # n is default to 5

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2021-11-24 04:22:14,33.93911,67.709953,157015,7305,NaN,NaN,Afghanistan,403.343672,4.652422
1,NaN,NaN,NaN,Albania,2021-11-24 04:22:14,41.15330,20.168300,197167,3053,NaN,NaN,Albania,6851.310028,1.548434
2,NaN,NaN,NaN,Algeria,2021-11-24 04:22:14,28.03390,1.659600,209283,6030,NaN,NaN,Algeria,477.258888,2.881266
3,NaN,NaN,NaN,Andorra,2021-11-24 04:22:14,42.50630,1.521800,16342,130,NaN,NaN,Andorra,21150.585647,0.795496
4,NaN,NaN,NaN,Angola,2021-11-24 04:22:14,-11.20270,17.873900,65061,1730,NaN,NaN,Angola,197.956762,2.659043

## `tail(n)` returns the bottom n observations with header

In [24]:
daily_report.tail(3)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4003,NaN,NaN,NaN,Yemen,2021-11-24 04:22:14,15.552727,48.516388,9967,1942,NaN,NaN,Yemen,33.417189,19.484298
4004,NaN,NaN,NaN,Zambia,2021-11-24 04:22:14,-13.133897,27.849332,210090,3667,NaN,NaN,Zambia,1142.789941,1.745442
4005,NaN,NaN,NaN,Zimbabwe,2021-11-24 04:22:14,-19.015438,29.154857,133674,4699,NaN,NaN,Zimbabwe,899.378702,3.515268

## `describe()` returns the descriptive summary for numeric columns

In [25]:
daily_report.describe()

,FIPS,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
count,3268.000000,3916.000000,3916.000000,4.006000e+03,4006.000000,0.0,0.0,3915.000000,3964.000000
mean,32405.943390,35.804041,-71.352046,6.460164e+04,1289.597853,NaN,NaN,13769.538218,3.031714
std,18056.381177,13.248365,54.904663,3.586794e+05,7159.778758,NaN,NaN,5552.158624,60.857516
min,60.000000,-52.368000,-178.116500,0.000000e+00,0.000000,NaN,NaN,0.000000,0.000000
25%,19048.500000,33.204471,-96.600814,1.831000e+03,29.000000,NaN,NaN,11046.225036,1.140307
50%,30068.000000,37.898574,-86.773508,5.173500e+03,85.000000,NaN,NaN,14930.658011,1.613080
75%,47041.500000,42.178547,-77.393577,2.114400e+04,303.000000,NaN,NaN,17384.484869,2.234326
max,99999.000000,71.706900,178.065000,8.626550e+06,153571.000000,NaN,NaN,55808.196571,3743.076923

## `info()` returns the concise information of the dataframe

In [26]:
daily_report.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4006 entries, 0 to 4005
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   FIPS                 3268 non-null   float64
 1   Admin2               3272 non-null   object
 2   Province_State       3832 non-null   object
 3   Country_Region       4006 non-null   object
 4   Last_Update          4006 non-null   object
 5   Lat                  3916 non-null   float64
 6   Long_                3916 non-null   float64
 7   Confirmed            4006 non-null   int64
 8   Deaths               4006 non-null   int64
 9   Recovered            0 non-null      float64
 10  Active               0 non-null      float64
 11  Combined_Key         4006 non-null   object
 12  Incident_Rate        3915 non-null   float64
 13  Case_Fatality_Ratio  3964 non-null   float64
dtypes: float64(7), int64(2), object(5)
memory usage: 438.3+ KB

## `set_index()` replaces current `Index` with a specific variable

In [27]:
daily_report.set_index('Combined_Key')

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
Combined_Key,,,,,,,,,,,,,
Afghanistan,NaN,NaN,NaN,Afghanistan,2021-11-24 04:22:14,33.939110,67.709953,157015,7305,NaN,NaN,403.343672,4.652422
Albania,NaN,NaN,NaN,Albania,2021-11-24 04:22:14,41.153300,20.168300,197167,3053,NaN,NaN,6851.310028,1.548434
Algeria,NaN,NaN,NaN,Algeria,2021-11-24 04:22:14,28.033900,1.659600,209283,6030,NaN,NaN,477.258888,2.881266
Andorra,NaN,NaN,NaN,Andorra,2021-11-24 04:22:14,42.506300,1.521800,16342,130,NaN,NaN,21150.585647,0.795496
Angola,NaN,NaN,NaN,Angola,2021-11-24 04:22:14,-11.202700,17.873900,65061,1730,NaN,NaN,197.956762,2.659043
...,...,...,...,...,...,...,...,...,...,...,...,...,...
Vietnam,NaN,NaN,NaN,Vietnam,2021-11-24 04:22:14,14.058324,108.277199,1143967,24118,NaN,NaN,1175.245175,2.108278
West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2021-11-24 04:22:14,31.952200,35.233200,458698,4781,NaN,NaN,8991.581945,1.042298
Yemen,NaN,NaN,NaN,Yemen,2021-11-24 04:22:14,15.552727,48.516388,9967,1942,NaN,NaN,33.417189,19.484298
Zambia,NaN,NaN,NaN,Zambia,2021-11-24 04:22:14,-13.133897,27.849332,210090,3667,NaN,NaN,1142.789941,1.745442
Zimbabwe,NaN,NaN,NaN,Zimbabwe,2021-11-24 04:22:14,-19.015438,29.154857,133674,4699,NaN,NaN,899.378702,3.515268

## `reset_index()` resets current `Index` with default `RangeIndex`

In [28]:
daily_report.set_index('Combined_Key').reset_index()

,Combined_Key,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
0,Afghanistan,NaN,NaN,NaN,Afghanistan,2021-11-24 04:22:14,33.939110,67.709953,157015,7305,NaN,NaN,403.343672,4.652422
1,Albania,NaN,NaN,NaN,Albania,2021-11-24 04:22:14,41.153300,20.168300,197167,3053,NaN,NaN,6851.310028,1.548434
2,Algeria,NaN,NaN,NaN,Algeria,2021-11-24 04:22:14,28.033900,1.659600,209283,6030,NaN,NaN,477.258888,2.881266
3,Andorra,NaN,NaN,NaN,Andorra,2021-11-24 04:22:14,42.506300,1.521800,16342,130,NaN,NaN,21150.585647,0.795496
4,Angola,NaN,NaN,NaN,Angola,2021-11-24 04:22:14,-11.202700,17.873900,65061,1730,NaN,NaN,197.956762,2.659043
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4001,Vietnam,NaN,NaN,NaN,Vietnam,2021-11-24 04:22:14,14.058324,108.277199,1143967,24118,NaN,NaN,1175.245175,2.108278
4002,West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2021-11-24 04:22:14,31.952200,35.233200,458698,4781,NaN,NaN,8991.581945,1.042298
4003,Yemen,NaN,NaN,NaN,Yemen,2021-11-24 04:22:14,15.552727,48.516388,9967,1942,NaN,NaN,33.417189,19.484298
4004,Zambia,NaN,NaN,NaN,Zambia,2021-11-24 04:22:14,-13.133897,27.849332,210090,3667,NaN,NaN,1142.789941,1.745442
4005,Zimbabwe,NaN,NaN,NaN,Zimbabwe,2021-11-24 04:22:14,-19.015438,29.154857,133674,4699,NaN,NaN,899.378702,3.515268

## Basic Wrangling

## Basic wrangling is like writing SQL queries

- Selecting: `SELECT FROM`
- Filtering: `WHERE`
- Subset: `SELECT FROM WHERE`

## Basic wrangling is like writing SQL queries(cont'd)

- Indexing
- Sorting: `ORDER BY`
- Deriving
- Summarizing
- Summarizing and Grouping: `GROUP BY`

## Selecting a column as `Series`

In [29]:
print(daily_report['Country_Region'])
print(type(daily_report['Country_Region']))

0              Afghanistan
1                  Albania
2                  Algeria
3                  Andorra
4                   Angola
               ...
4001               Vietnam
4002    West Bank and Gaza
4003                 Yemen
4004                Zambia
4005              Zimbabwe
Name: Country_Region, Length: 4006, dtype: object
<class 'pandas.core.series.Series'>

## Selecting a column as `DataFrame`

In [30]:
print(type(daily_report[['Country_Region']]))
daily_report[['Country_Region']]

<class 'pandas.core.frame.DataFrame'>

          Country_Region
0            Afghanistan
1                Albania
2                Algeria
3                Andorra
4                 Angola
...                  ...
4001             Vietnam
4002  West Bank and Gaza
4003               Yemen
4004              Zambia
4005            Zimbabwe

[4006 rows x 1 columns]

## Selecting multiple columns as `DataFrame`, for sure

In [31]:
cols = ['Country_Region', 'Confirmed', 'Deaths']
daily_report[cols]

          Country_Region  Confirmed  Deaths
0            Afghanistan     157015    7305
1                Albania     197167    3053
2                Algeria     209283    6030
3                Andorra      16342     130
4                 Angola      65061    1730
...                  ...        ...     ...
4001             Vietnam    1143967   24118
4002  West Bank and Gaza     458698    4781
4003               Yemen       9967    1942
4004              Zambia     210090    3667
4005            Zimbabwe     133674    4699

[4006 rows x 3 columns]

## Filtering rows with conditional statements

In [32]:
is_taiwan = daily_report['Country_Region'] == 'Taiwan*'
daily_report[is_taiwan]

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
663,NaN,NaN,NaN,Taiwan*,2021-11-24 04:22:14,23.7,121.0,16539,848,NaN,NaN,Taiwan*,69.442651,5.127275

## Subsetting columns and rows simultaneously

In [33]:
cols_to_select = ['Country_Region', 'Confirmed', 'Deaths']
rows_to_filter = daily_report['Country_Region'] == 'Taiwan*'
daily_report[rows_to_filter][cols_to_select]

    Country_Region  Confirmed  Deaths
663        Taiwan*      16539     848

## Indexing `DataFrame` with

- `loc[]`
- `iloc[]`

## `loc[]` is indexing `DataFrame` with `Index`

In [34]:
taiwan_row_index = daily_report[is_taiwan].index[0]
print(daily_report.loc[taiwan_row_index, ['Country_Region', 'Confirmed']]) # as Series
daily_report.loc[[taiwan_row_index], ['Country_Region', 'Confirmed']] # as DataFrame

Country_Region    Taiwan*
Confirmed           16539
Name: 663, dtype: object

    Country_Region  Confirmed
663        Taiwan*      16539

## `iloc[]` is indexing `DataFrame` with absolute position

In [35]:
print(daily_report.iloc[taiwan_row_index, [3, 7]]) # as Series
daily_report.iloc[[taiwan_row_index], [3, 7]] # as DataFrame

Country_Region    Taiwan*
Confirmed           16539
Name: 663, dtype: object

    Country_Region  Confirmed
663        Taiwan*      16539

## Sorting `DataFrame` with

- `sort_values`
- `sort_index`

## `sort_values` sorts `DataFrame` with specific columns

In [36]:
daily_report.sort_values(['Country_Region', 'Confirmed'])

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2021-11-24 04:22:14,33.939110,67.709953,157015,7305,NaN,NaN,Afghanistan,403.343672,4.652422
1,NaN,NaN,NaN,Albania,2021-11-24 04:22:14,41.153300,20.168300,197167,3053,NaN,NaN,Albania,6851.310028,1.548434
2,NaN,NaN,NaN,Algeria,2021-11-24 04:22:14,28.033900,1.659600,209283,6030,NaN,NaN,Algeria,477.258888,2.881266
3,NaN,NaN,NaN,Andorra,2021-11-24 04:22:14,42.506300,1.521800,16342,130,NaN,NaN,Andorra,21150.585647,0.795496
4,NaN,NaN,NaN,Angola,2021-11-24 04:22:14,-11.202700,17.873900,65061,1730,NaN,NaN,Angola,197.956762,2.659043
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4001,NaN,NaN,NaN,Vietnam,2021-11-24 04:22:14,14.058324,108.277199,1143967,24118,NaN,NaN,Vietnam,1175.245175,2.108278
4002,NaN,NaN,NaN,West Bank and Gaza,2021-11-24 04:22:14,31.952200,35.233200,458698,4781,NaN,NaN,West Bank and Gaza,8991.581945,1.042298
4003,NaN,NaN,NaN,Yemen,2021-11-24 04:22:14,15.552727,48.516388,9967,1942,NaN,NaN,Yemen,33.417189,19.484298
4004,NaN,NaN,NaN,Zambia,2021-11-24 04:22:14,-13.133897,27.849332,210090,3667,NaN,NaN,Zambia,1142.789941,1.745442
4005,NaN,NaN,NaN,Zimbabwe,2021-11-24 04:22:14,-19.015438,29.154857,133674,4699,NaN,NaN,Zimbabwe,899.378702,3.515268

## `sort_index` sorts `DataFrame` with the `Index` of `DataFrame`

In [37]:
daily_report.sort_index(ascending=False)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4005,NaN,NaN,NaN,Zimbabwe,2021-11-24 04:22:14,-19.015438,29.154857,133674,4699,NaN,NaN,Zimbabwe,899.378702,3.515268
4004,NaN,NaN,NaN,Zambia,2021-11-24 04:22:14,-13.133897,27.849332,210090,3667,NaN,NaN,Zambia,1142.789941,1.745442
4003,NaN,NaN,NaN,Yemen,2021-11-24 04:22:14,15.552727,48.516388,9967,1942,NaN,NaN,Yemen,33.417189,19.484298
4002,NaN,NaN,NaN,West Bank and Gaza,2021-11-24 04:22:14,31.952200,35.233200,458698,4781,NaN,NaN,West Bank and Gaza,8991.581945,1.042298
4001,NaN,NaN,NaN,Vietnam,2021-11-24 04:22:14,14.058324,108.277199,1143967,24118,NaN,NaN,Vietnam,1175.245175,2.108278
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,NaN,NaN,NaN,Angola,2021-11-24 04:22:14,-11.202700,17.873900,65061,1730,NaN,NaN,Angola,197.956762,2.659043
3,NaN,NaN,NaN,Andorra,2021-11-24 04:22:14,42.506300,1.521800,16342,130,NaN,NaN,Andorra,21150.585647,0.795496
2,NaN,NaN,NaN,Algeria,2021-11-24 04:22:14,28.033900,1.659600,209283,6030,NaN,NaN,Algeria,477.258888,2.881266
1,NaN,NaN,NaN,Albania,2021-11-24 04:22:14,41.153300,20.168300,197167,3053,NaN,NaN,Albania,6851.310028,1.548434
0,NaN,NaN,NaN,Afghanistan,2021-11-24 04:22:14,33.939110,67.709953,157015,7305,NaN,NaN,Afghanistan,403.343672,4.652422

## Deriving new variables from `DataFrame`

- Simple operations
- `map` with a `dict`
- `map` with a function(or a lambda expression)

## Deriving new variable with simple operations

In [38]:
case_fatality_ratio = daily_report['Deaths'] / daily_report['Confirmed']
case_fatality_ratio

0       0.046524
1       0.015484
2       0.028813
3       0.007955
4       0.026590
          ...
4001    0.021083
4002    0.010423
4003    0.194843
4004    0.017454
4005    0.035153
Length: 4006, dtype: float64

## Deriving categorical from categorical with `map`

- Passing a `dict`
- Passing a function(or lambda expression)

In [39]:
# Passing a dict
country_name = {
    'Taiwan*': 'Taiwan'
}
daily_report_tw = daily_report[is_taiwan]
daily_report_tw['Country_Region'].map(country_name)

663    Taiwan
Name: Country_Region, dtype: object

In [40]:
# Passing a function
def replace_asterisk(x):
    if "*" in x:
        return x.replace("*", "")
    else:
        return x

daily_report['Country_Region'].map(replace_asterisk)[taiwan_row_index]

'Taiwan'

In [41]:
# Passing a lambda expression)
daily_report['Country_Region'].map(lambda x: x.replace("*", "") if "*" in x else x)[taiwan_row_index]

'Taiwan'

## Summarizing `DataFrame` with aggregate methods

In [42]:
daily_report['Confirmed'].sum()

258794189

## Summarizing and grouping `DataFrame` with aggregate methods

In [43]:
daily_report.groupby('Country_Region')['Confirmed'].sum()

Country_Region
Afghanistan            157015
Albania                197167
Algeria                209283
Andorra                 16342
Angola                  65061
                       ...
Vietnam               1143967
West Bank and Gaza     458698
Yemen                    9967
Zambia                 210090
Zimbabwe               133674
Name: Confirmed, Length: 196, dtype: int64

## Advanced Wrangling

## Other common wranglings including

- Dealing with missing values
- Dealing with text values
- Reshaping dataframes
- Merging and joining dataframes

## Dealing with missing values

- Using `isnull` or `notnull` to check if `np.NaN` exists
- Using `dropna` to drop rows with `np.NaN`
- Using `fillna` to fill `np.NaN` with specific values

In [44]:
print(daily_report['Province_State'].size)
print(daily_report['Province_State'].isnull().sum())
print(daily_report['Province_State'].notnull().sum())

4006
174
3832

In [45]:
print(daily_report.dropna().shape)
print(daily_report['FIPS'].fillna(0))

(0, 14)
0       0.0
1       0.0
2       0.0
3       0.0
4       0.0
       ...
4001    0.0
4002    0.0
4003    0.0
4004    0.0
4005    0.0
Name: FIPS, Length: 4006, dtype: float64

## Summarizing text columns

- `unique`
- `nunique`
- `value_counts`

In [46]:
print(daily_report['Country_Region'].nunique())
print(daily_report['Country_Region'].unique())

196
['Afghanistan' 'Albania' 'Algeria' 'Andorra' 'Angola'
 'Antigua and Barbuda' 'Argentina' 'Armenia' 'Australia' 'Austria'
 'Azerbaijan' 'Bahamas' 'Bahrain' 'Bangladesh' 'Barbados' 'Belarus'
 'Belgium' 'Belize' 'Benin' 'Bhutan' 'Bolivia' 'Bosnia and Herzegovina'
 'Botswana' 'Brazil' 'Brunei' 'Bulgaria' 'Burkina Faso' 'Burma' 'Burundi'
 'Cabo Verde' 'Cambodia' 'Cameroon' 'Canada' 'Central African Republic'
 'Chad' 'Chile' 'China' 'Colombia' 'Comoros' 'Congo (Brazzaville)'
 'Congo (Kinshasa)' 'Costa Rica' "Cote d'Ivoire" 'Croatia' 'Cuba' 'Cyprus'
 'Czechia' 'Denmark' 'Diamond Princess' 'Djibouti' 'Dominica'
 'Dominican Republic' 'Ecuador' 'Egypt' 'El Salvador' 'Equatorial Guinea'
 'Eritrea' 'Estonia' 'Eswatini' 'Ethiopia' 'Fiji' 'Finland' 'France'
 'Gabon' 'Gambia' 'Georgia' 'Germany' 'Ghana' 'Greece' 'Grenada'
 'Guatemala' 'Guinea' 'Guinea-Bissau' 'Guyana' 'Haiti' 'Holy See'
 'Honduras' 'Hungary' 'Iceland' 'India' 'Indonesia' 'Iran' 'Iraq'
 'Ireland' 'Israel' 'Italy' 'Jamaica' 'Japan' 'Jordan' 'Kazakhstan'
 'Kenya' 'Kiribati' 'Korea, South' 'Kosovo' 'Kuwait' 'Kyrgyzstan' 'Laos'
 'Latvia' 'Lebanon' 'Lesotho' 'Liberia' 'Libya' 'Liechtenstein'
 'Lithuania' 'Luxembourg' 'MS Zaandam' 'Madagascar' 'Malawi' 'Malaysia'
 'Maldives' 'Mali' 'Malta' 'Marshall Islands' 'Mauritania' 'Mauritius'
 'Mexico' 'Micronesia' 'Moldova' 'Monaco' 'Mongolia' 'Montenegro'
 'Morocco' 'Mozambique' 'Namibia' 'Nepal' 'Netherlands' 'New Zealand'
 'Nicaragua' 'Niger' 'Nigeria' 'North Macedonia' 'Norway' 'Oman'
 'Pakistan' 'Palau' 'Panama' 'Papua New Guinea' 'Paraguay' 'Peru'
 'Philippines' 'Poland' 'Portugal' 'Qatar' 'Romania' 'Russia' 'Rwanda'
 'Saint Kitts and Nevis' 'Saint Lucia' 'Saint Vincent and the Grenadines'
 'Samoa' 'San Marino' 'Sao Tome and Principe' 'Saudi Arabia' 'Senegal'
 'Serbia' 'Seychelles' 'Sierra Leone' 'Singapore' 'Slovakia' 'Slovenia'
 'Solomon Islands' 'Somalia' 'South Africa' 'South Sudan' 'Spain'
 'Sri Lanka' 'Sudan' 'Summer Olympics 2020' 'Suriname' 'Sweden'
 'Switzerland' 'Syria' 'Taiwan*' 'Tajikistan' 'Tanzania' 'Thailand'
 'Timor-Leste' 'Togo' 'Tonga' 'Trinidad and Tobago' 'Tunisia' 'Turkey'
 'US' 'Uganda' 'Ukraine' 'United Arab Emirates' 'United Kingdom' 'Uruguay'
 'Uzbekistan' 'Vanuatu' 'Venezuela' 'Vietnam' 'West Bank and Gaza' 'Yemen'
 'Zambia' 'Zimbabwe']

In [47]:
daily_report['Country_Region'].value_counts().sort_values(ascending=False)

US            3279
Russia          83
Japan           49
India           37
Colombia        34
              ...
Norway           1
Costa Rica       1
Nigeria          1
Uzbekistan       1
Slovakia         1
Name: Country_Region, Length: 196, dtype: int64

## Splitting strings with `str.split` as a `Series`

In [48]:
request_url = "https://www.imdb.com/chart/top"
html_tables = pd.read_html(request_url)
html_table = html_tables[0]
html_table.head()

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. 刺激1995 (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. 教父 (1972),9.1,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. 教父第二集 (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. 黑暗騎士 (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. 十二怒漢 (1957),8.9,12345678910 NOT YET RELEASED Seen,NaN

In [49]:
html_table['Rank & Title'].str.split()

0                  [1., 刺激1995, (1994)]
1                      [2., 教父, (1972)]
2                   [3., 教父第二集, (1974)]
3                    [4., 黑暗騎士, (2008)]
4                    [5., 十二怒漢, (1957)]
                     ...
245              [246., 阿爾及爾之戰, (1966)]
246              [247., 卡比莉亞之夜, (1957)]
247                [248., 公主新娘, (1987)]
248               [249., 巴黎，德州, (1984)]
249    [250., Soorarai, Pottru, (2020)]
Name: Rank & Title, Length: 250, dtype: object

## Splitting strings with `str.split` as a `DataFrame`

In [50]:
html_table['Rank & Title'].str.split(expand=True)

        0         1       2       3
0      1.    刺激1995  (1994)    None
1      2.        教父  (1972)    None
2      3.     教父第二集  (1974)    None
3      4.      黑暗騎士  (2008)    None
4      5.      十二怒漢  (1957)    None
..    ...       ...     ...     ...
245  246.    阿爾及爾之戰  (1966)    None
246  247.    卡比莉亞之夜  (1957)    None
247  248.      公主新娘  (1987)    None
248  249.     巴黎，德州  (1984)    None
249  250.  Soorarai  Pottru  (2020)

[250 rows x 4 columns]

## Replacing strings with `str.replace`

In [51]:
split_dataframe = html_table['Rank & Title'].str.split(expand=True)
ranks = split_dataframe[0].str.replace(".", '')
ranks

<ipython-input-51-4708468c57af>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  ranks = split_dataframe[0].str.replace(".", '')

0        1
1        2
2        3
3        4
4        5
      ...
245    246
246    247
247    248
248    249
249    250
Name: 0, Length: 250, dtype: object

In [52]:
split_dataframe = html_table['Rank & Title'].str.split(expand=True)
years = split_dataframe[2].str.replace("\(|\)", '')
years

<ipython-input-52-7131e60c10b2>:2: FutureWarning: The default value of regex will change from True to False in a future version.
  years = split_dataframe[2].str.replace("\(|\)", '')

0        1994
1        1972
2        1974
3        2008
4        1957
        ...
245      1966
246      1957
247      1987
248      1984
249    Pottru
Name: 2, Length: 250, dtype: object

## Testing for strings that match or contain a pattern with `str.contains`

In [53]:
print(daily_report['Country_Region'].str.contains('land').sum())
daily_report[daily_report['Country_Region'].str.contains('land')]

27

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
204,NaN,NaN,NaN,Finland,2021-11-24 04:22:14,61.924110,25.748151,178527,1263,NaN,NaN,Finland,3222.091433,0.707456
248,NaN,NaN,NaN,Iceland,2021-11-24 04:22:14,64.963100,-19.020800,17002,34,NaN,NaN,Iceland,4982.271062,0.199976
289,NaN,NaN,NaN,Ireland,2021-11-24 04:22:14,53.142400,-7.692100,538255,5609,NaN,NaN,Ireland,10900.713598,1.042071
402,NaN,NaN,NaN,Marshall Islands,2021-11-24 04:22:14,7.131500,171.184500,4,0,NaN,NaN,Marshall Islands,6.847791,0.000000
447,NaN,NaN,Aruba,Netherlands,2021-11-24 04:22:14,12.521100,-69.968300,16230,173,NaN,NaN,"Aruba, Netherlands",15201.468632,1.065927
448,NaN,NaN,"Bonaire, Sint Eustatius and Saba",Netherlands,2021-11-24 04:22:14,12.178400,-68.238500,2763,21,NaN,NaN,"Bonaire, Sint Eustatius and Saba, Netherlands",10537.355555,0.760043
449,NaN,NaN,Curacao,Netherlands,2021-11-24 04:22:14,12.169600,-68.990000,17348,178,NaN,NaN,"Curacao, Netherlands",10571.602681,1.026055
450,NaN,NaN,Drenthe,Netherlands,2021-11-24 04:22:14,52.862485,6.618435,49364,380,NaN,NaN,"Drenthe, Netherlands",9999.149250,0.769792
451,NaN,NaN,Flevoland,Netherlands,2021-11-24 04:22:14,52.550383,5.515162,56754,275,NaN,NaN,"Flevoland, Netherlands",13416.355216,0.484547
452,NaN,NaN,Friesland,Netherlands,2021-11-24 04:22:14,53.087337,5.792500,72389,510,NaN,NaN,"Friesland, Netherlands",11137.506020,0.704527
453,NaN,NaN,Gelderland,Netherlands,2021-11-24 04:22:14,52.061738,5.939114,285700,2256,NaN,NaN,"Gelderland, Netherlands",13696.384193,0.789639
454,NaN,NaN,Groningen,Netherlands,2021-11-24 04:22:14,53.217922,6.741514,60454,281,NaN,NaN,"Groningen, Netherlands",10318.741828,0.464816
455,NaN,NaN,Limburg,Netherlands,2021-11-24 04:22:14,51.209227,5.933870,177150,1833,NaN,NaN,"Limburg, Netherlands",15856.591607,1.034716
456,NaN,NaN,Noord-Brabant,Netherlands,2021-11-24 04:22:14,51.561174,5.184942,381301,3284,NaN,NaN,"Noord-Brabant, Netherlands",14877.397379,0.861262
457,NaN,NaN,Noord-Holland,Netherlands,2021-11-24 04:22:14,52.600906,4.918688,413182,2830,NaN,NaN,"Noord-Holland, Netherlands",14348.953839,0.684928
458,NaN,NaN,Overijssel,Netherlands,2021-11-24 04:22:14,52.444558,6.441722,162568,1236,NaN,NaN,"Overijssel, Netherlands",13985.474955,0.760297
459,NaN,NaN,Sint Maarten,Netherlands,2021-11-24 04:22:14,18.042500,-63.054800,4565,75,NaN,NaN,"Sint Maarten, Netherlands",10645.492281,1.642935
460,NaN,NaN,Unknown,Netherlands,2021-11-24 04:22:14,NaN,NaN,9629,15,NaN,NaN,"Unknown, Netherlands",NaN,0.155779
461,NaN,NaN,Utrecht,Netherlands,2021-11-24 04:22:14,52.084251,5.163824,194141,1342,NaN,NaN,"Utrecht, Netherlands",14329.504574,0.691250
462,NaN,NaN,Zeeland,Netherlands,2021-11-24 04:22:14,51.479360,3.861559,46883,271,NaN,NaN,"Zeeland, Netherlands",12225.415137,0.578035
463,NaN,NaN,Zuid-Holland,Netherlands,2021-11-24 04:22:14,51.937835,4.462114,578729,4535,NaN,NaN,"Zuid-Holland, Netherlands",15604.649181,0.783614
464,NaN,NaN,Cook Islands,New Zealand,2021-11-24 04:22:14,-21.236700,-159.777700,1,0,NaN,NaN,"Cook Islands, New Zealand",5.727705,0.000000
465,NaN,NaN,NaN,New Zealand,2021-11-24 04:22:14,-40.900600,174.886000,10609,40,NaN,NaN,New Zealand,220.001812,0.377038
510,NaN,NaN,NaN,Poland,2021-11-24 04:22:14,51.919400,19.145100,3377698,81228,NaN,NaN,Poland,8924.705400,2.404833
612,NaN,NaN,NaN,Solomon Islands,2021-11-24 04:22:14,-9.645700,160.156200,20,0,NaN,NaN,Solomon Islands,3.063453,0.000000
661,NaN,NaN,NaN,Switzerland,2021-11-24 04:22:14,46.818200,8.227500,962165,11416,NaN,NaN,Switzerland,11117.359541,1.186491
666,NaN,NaN,NaN,Thailand,2021-11-24 04:22:14,15.870032,100.992541,2076135,20489,NaN,NaN,Thailand,2974.406382,0.986882

## Reshaping dataframes from wide to long format with `pd.melt`

A common problem is that a dataset where some of the column names are not names of variables, but values of a variable.

In [54]:
ts_confirmed_global_url = "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv"
ts_confirmed_global = pd.read_csv(ts_confirmed_global_url)
ts_confirmed_global

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,11/14/21,11/15/21,11/16/21,11/17/21,11/18/21,11/19/21,11/20/21,11/21/21,11/22/21,11/23/21
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,156552,156610,156649,156739,156739,156812,156864,156896,156911,157015
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,193075,193269,193856,194472,195021,195523,195988,195988,196611,197167
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,207970,208104,208245,208380,208532,208695,208839,208952,209111,209283
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,15819,15907,15929,15972,16035,16086,16086,16086,16299,16342
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,64913,64913,64940,64968,64985,64997,65011,65024,65033,65061
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
275,NaN,Vietnam,14.058324,108.277199,0,2,2,2,2,2,...,1026522,1035138,1045397,1055246,1065469,1075094,1084625,1094514,1104835,1143967
276,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,456632,457154,457390,457477,457729,457950,457950,457950,458448,458698
277,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,9918,9936,9936,9947,9950,9954,9955,9955,9961,9967
278,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,209983,209996,210008,210020,210036,210043,210057,210070,210073,210090
279,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,133428,133438,133505,133557,133593,133593,133615,133647,133674,133674

## We can pivot the columns into a new pair of variables

To describe that operation we need four parameters:

- The set of columns whose names are not values
- The set of columns whose names are values
- The name of the variable to move the column names to
- The name of the variable to move the column values to

## In this example, the four parameters are

- `id_vars`: `['Province/State', 'Country/Region', 'Lat', 'Long']`
- `value_vars`: The columns from `1/22/20` to the last column
- `var_name`: Let's name it `Date`
- `value_name`: Let's name it `Confirmed`

In [55]:
idVars = ['Province/State', 'Country/Region', 'Lat', 'Long']
ts_confirmed_global_long = pd.melt(ts_confirmed_global,
                                   id_vars=idVars,
                                   var_name='Date',
                                   value_name='Confirmed')
ts_confirmed_global_long

,Province/State,Country/Region,Lat,Long,Date,Confirmed
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
188155,NaN,Vietnam,14.058324,108.277199,11/23/21,1143967
188156,NaN,West Bank and Gaza,31.952200,35.233200,11/23/21,458698
188157,NaN,Yemen,15.552727,48.516388,11/23/21,9967
188158,NaN,Zambia,-13.133897,27.849332,11/23/21,210090
188159,NaN,Zimbabwe,-19.015438,29.154857,11/23/21,133674

## Merging and joining dataframes

- `merge` on column names
- `join` on index

In [56]:
def get_top_rated_movies():
    request_url = "https://www.imdb.com/chart/top"
    html_tables = pd.read_html(request_url)
    html_table = html_tables[0]
    split_dataframe = html_table['Rank & Title'].str.split(expand=True)
    ranks = split_dataframe[0].str.replace(".", '').values
    years = split_dataframe[2].str.replace("\(|\)", '').values
    titles = split_dataframe[1].values
    ratings = html_table['IMDb Rating'].values
    out = pd.DataFrame()
    out['rank'] = ranks
    out['title'] = titles
    out['year'] = years
    out['rating'] = ratings
    return out

top_rated_movies = get_top_rated_movies()

<ipython-input-56-cd1fafe36768>:6: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  ranks = split_dataframe[0].str.replace(".", '').values
<ipython-input-56-cd1fafe36768>:7: FutureWarning: The default value of regex will change from True to False in a future version.
  years = split_dataframe[2].str.replace("\(|\)", '').values

In [57]:
left_df = top_rated_movies.loc[:9, ['title', 'year']]
right_df = top_rated_movies[top_rated_movies['title'].str.contains('魔戒')][['title', 'rating']].reset_index(drop=True)
left_df

        title  year
0      刺激1995  1994
1          教父  1972
2       教父第二集  1974
3        黑暗騎士  2008
4        十二怒漢  1957
5      辛德勒的名單  1993
6  魔戒三部曲：王者再臨  2003
7       黑色追緝令  1994
8       黃昏三鏢客  1966
9  魔戒首部曲：魔戒現身  2001

In [58]:
right_df

        title  rating
0  魔戒三部曲：王者再臨     8.9
1  魔戒首部曲：魔戒現身     8.8
2  魔戒二部曲：雙城奇謀     8.7

## Using `merge` function to join dataframes on columns

In [59]:
# default: inner join
pd.merge(left_df, right_df)

        title  year  rating
0  魔戒三部曲：王者再臨  2003     8.9
1  魔戒首部曲：魔戒現身  2001     8.8

In [60]:
# left join
pd.merge(left_df, right_df, how='left')

        title  year  rating
0      刺激1995  1994     NaN
1          教父  1972     NaN
2       教父第二集  1974     NaN
3        黑暗騎士  2008     NaN
4        十二怒漢  1957     NaN
5      辛德勒的名單  1993     NaN
6  魔戒三部曲：王者再臨  2003     8.9
7       黑色追緝令  1994     NaN
8       黃昏三鏢客  1966     NaN
9  魔戒首部曲：魔戒現身  2001     8.8

In [61]:
# right join
pd.merge(left_df, right_df, how='right')

        title  year  rating
0  魔戒三部曲：王者再臨  2003     8.9
1  魔戒首部曲：魔戒現身  2001     8.8
2  魔戒二部曲：雙城奇謀   NaN     8.7

## Using `join` method to join dataframes on index

In [62]:
# join dataframes on index
left_df.join(right_df, lsuffix='_x', rsuffix='_y')

      title_x  year     title_y  rating
0      刺激1995  1994  魔戒三部曲：王者再臨     8.9
1          教父  1972  魔戒首部曲：魔戒現身     8.8
2       教父第二集  1974  魔戒二部曲：雙城奇謀     8.7
3        黑暗騎士  2008         NaN     NaN
4        十二怒漢  1957         NaN     NaN
5      辛德勒的名單  1993         NaN     NaN
6  魔戒三部曲：王者再臨  2003         NaN     NaN
7       黑色追緝令  1994         NaN     NaN
8       黃昏三鏢客  1966         NaN     NaN
9  魔戒首部曲：魔戒現身  2001         NaN     NaN

In [63]:
left_df = left_df.set_index('title')
right_df = right_df.set_index('title')
# default: left join
left_df.join(right_df)

            year  rating
title
刺激1995      1994     NaN
教父          1972     NaN
教父第二集       1974     NaN
黑暗騎士        2008     NaN
十二怒漢        1957     NaN
辛德勒的名單      1993     NaN
魔戒三部曲：王者再臨  2003     8.9
黑色追緝令       1994     NaN
黃昏三鏢客       1966     NaN
魔戒首部曲：魔戒現身  2001     8.8

In [64]:
# inner join
left_df.join(right_df, how='inner')

            year  rating
title
魔戒三部曲：王者再臨  2003     8.9
魔戒首部曲：魔戒現身  2001     8.8

In [65]:
# right join
left_df.join(right_df, how='right')

            year  rating
title
魔戒三部曲：王者再臨  2003     8.9
魔戒首部曲：魔戒現身  2001     8.8
魔戒二部曲：雙城奇謀   NaN     8.7